[
  {
    "id": "0",
    "name": "Online School",
    "description": "The Online School Project is a dynamic and comprehensive web-based educational platform designed to replicate the experience of traditional schooling in a digital format. This system fosters seamless interactions between students and teachers through a secure, user-friendly interface. It features role-based dashboards, where teachers can create, update, and manage courses, track enrollments, and oversee transactions, while students can easily enroll in courses, submit feedback, and manage their course engagements. The platform emphasizes security and user customization, allowing profile updates, including images and passwords, for all users. Equipped with a feedback system for course reviews, it encourages continuous improvement. Built using Python, Django, and PostgreSQL for the backend, paired with React JS and Bootstrap for the frontend, and deployed on Vercel, the Online School Project ensures a robust, scalable, and efficient educational environment that supports both teaching and learning.",
    "gitHub": "https://github.com/46ra20/DRF_FrontEnd",
    "server": "https://github.com/46ra20/drf_online_school-jsrn-",
    "live": "https://46ra20.github.io/DRF_FrontEnd/",
    "features": [
      "User Authentication: Secure login and registration with email verification for both students and teachers.",
"Role-Based Dashboards:Teacher Dashboard: Create, update, and manage courses; monitor student enrollment; track transactions; and review favorite and enrolled courses.",
"Student Dashboard: Enroll in courses, submit reviews, manage enrolled courses, and opt for unenrollment as needed.",
"Course Management: Teachers can add, edit, and delete courses, while students can browse and choose courses to join.",
"Profile Customization: All users can update their profile information, including images, passwords, and personal details.",
"Review and Feedback System: Students can provide feedback on courses, helping to maintain high standards and improve the content offered."
    ],
    "technology": [
      "Backend: Python, Django, Django REST Framework",
"Database: PostgreSQL, Supabase",
"Frontend: JavaScript, React JS, HTML5, CSS3, Bootstrap, Tailwind CSS",
"Deployment: Vercel for reliable and scalable service"
    ],
    "pictures": [
      "https://i.ibb.co.com/xXmnN4k/1-1.png",
      "https://i.ibb.co.com/fGcWm8G/1-2.png",
      "https://i.ibb.co.com/MkGdCbV/1-3.png",
      "https://i.ibb.co.com/ChyQXfW/1-4.png"
    ]
  },
  {
    "id": "1",
    "name": "POS System",
    "description": "The POS (Point of Sale) System is a specialized application designed for shops and marketplaces to streamline daily operations and enhance business management. This system provides a comprehensive set of features, including secure user login, detailed dashboards summarizing financial performance, and modules for sales, returns, purchases, and stock management. Users can track inventory in real time, record damaged items, and manage expenses and payments seamlessly. Additionally, it supports product information management by allowing the addition of products, categories, and brands. With integrated promotional tools such as SMS marketing, businesses can easily engage customers and drive sales. Built using robust backend technologies like Python, Django, and PostgreSQL, and supported by a modern frontend with JavaScript, HTML5, and Bootstrap, this POS system ensures reliability, scalability, and user-friendly functionality.",
    "gitHub": "https://github.com/46ra20/pos_frontend",
    "server": "https://github.com/46ra20/POS_on_vercel",
    "live": "https://46ra20.github.io/pos_frontend/",
    "features": [
      "Secure Login System: Access restricted to authorized users with unique credentials.",
"Dashboard: Overview of daily, monthly, and yearly financial summaries for quick insights into business performance.",
"Sales & Returns: Record and manage sales and returns, with a full history of transactions.",
"Purchases & Stock Management: Log purchases and maintain an updated stock list with real-time tracking.",
"Product Information Management: Add and manage products, units, categories, and brands to maintain an organized inventory.",
"Expenses & Payments: Record and track expenses and payments, complete with historical data for financial auditing.",
"Promotional Tools: Send targeted promotional SMS campaigns to engage customers and drive sales."
    ],
    "technology": [
      "Backend: Python, Django, Django REST Framework for robust server-side development.",
"Database: PostgreSQL for reliable data management, supported by Supabase for extended database functionalities.",
"Frontend: JavaScript and React JS for dynamic and interactive UI, with HTML5 and CSS3 providing the structural and stylistic foundation. Bootstrap and Tailwind CSS ensure a responsive and modern design.",
"Deployment: Vercel for scalable, reliable hosting and seamless deployment."
    ],
    "pictures": [
      "https://i.ibb.co.com/4MXqD3K/2-3.png",
      "https://i.ibb.co.com/GJd80MT/2-1.png",
      "https://i.ibb.co.com/dj0Ns8R/2-2.png",
      "https://i.ibb.co.com/rpg6Mdq/2-4.png"
    ]
  },
  {
    "id": "2",
    "name": "Bank Management",
    "description": "Mamar Bank is a bank management system developed as part of a Phitron course, utilizing Python ORM and Django to provide a secure and efficient backend. The system allows users to register, log in, deposit and transfer money, submit loan requests, and access detailed transaction reports. Designed with user convenience in mind, Mamar Bank streamlines essential banking functions in a seamless manner. Deployed on OnRender, the application benefits from reliable and scalable access, demonstrating modern web technologies' capability to support robust financial operations.",
    "gitHub": "https://github.com/46ra20/bank-management",
    "server": "https://github.com/46ra20/bank-management",
    "live": "https://bank-management-gpr8.onrender.com/",
    "features": ["User Registration and Authentication: Users can securely register and log in to their accounts.","Deposit and Withdrawals: Users can deposit funds and manage their balances with ease.",
"Money Transfer: A straightforward interface for transferring money between accounts securely.",
"Loan Management: Users can submit loan requests for review and processing.",
"Transaction Reports: Detailed transaction reports to track all financial activities for better account management."],
    "technology": [
      "Database:SQLite (or any Django-compatible database): For storing user information, transactions, and loan records.",
      "Frontend: HTML5, CSS3: For structuring and styling the user interface. JavaScript: For adding interactivity and enhancing the user experience.",
      "Deployment:The project is hosted on OnRender, which provides a reliable and scalable environment for deploying web applications. This platform ensures seamless access and supports the necessary backend and frontend technologies to maintain the system’s performance and availability."
    ],
    "pictures": [
      "https://i.ibb.co.com/JdDCQyf/4-1.png",
      "https://i.ibb.co.com/vsP6mBY/4-2.png",
      "https://i.ibb.co.com/wdSMrhM/4-3.png",
      "https://i.ibb.co.com/9G2G47D/4-4.png"
    ]
  },
  {
    "id": "3",
    "name": "Speed Monster",
    "description": "Speed Monster is a practice typing project designed to help users enhance their typing speed and accuracy through an engaging and interactive experience. Built using core web technologies like HTML, CSS, and JavaScript, the project provides a user-friendly interface that encourages consistent practice. With real-time feedback on typing speed and accuracy, users can easily monitor their progress and aim for improvement. The project includes dynamic exercises that adapt in difficulty to maintain user interest and promote growth. Its responsive design ensures a seamless experience across various devices, whether on desktop or mobile. Deployed on Vercel, Speed Monster offers reliable and scalable access, allowing users to practice and sharpen their typing skills anytime, anywhere.",
    "gitHub": "https://github.com/46ra20/Speed_Typer",
    "server": "",
    "live": "https://subtle-jelly-3e7be8.netlify.app/",
    "features": ["User-Friendly Interface: A clean, intuitive layout that encourages users to practice typing without distractions.",
"Real-Time Feedback: Immediate response to user input displaying speed metrics and accuracy rates to help track improvement.",
"Dynamic Challenges: Various typing exercises that adjust difficulty to keep users engaged.",
"Responsive Design: Ensures a seamless experience across different devices, whether on a desktop or mobile."],
    "technology": ["HTML5: For structuring the content of the web pages.",
"CSS3: For styling and creating a visually appealing and responsive design.",
"JavaScript: For adding interactivity and real-time typing feedback functionalities."],
    "pictures": [
      "https://i.ibb.co.com/MSqnh4c/3-1.png",
      "https://i.ibb.co.com/GHLBhLP/3-2.png",
      "https://i.ibb.co.com/VNC8Xb1/3-3.png",
      "https://i.ibb.co.com/PDxcd66/3-4.png"
    ]
  }
]